flyghost/OneOS-V2.1.0/components/net/molink/module/esp8266/source/esp8266_netconn.c
/**
 ***********************************************************************************************************************
 * Copyright (c) 2020, China Mobile Communications Group Co.,Ltd.
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with
 * the License. You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on
 * an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the
 * specific language governing permissions and limitations under the License.
 *
 * @file        esp8266.c
 *
 * @brief       esp8266 module link kit netconn api implement
 *
 * @revision
 * Date         Author          Notes
 * 2020-03-25   OneOS Team      First Version
 ***********************************************************************************************************************
 */

#include "esp8266_netconn.h"
#include "esp8266.h"

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#define MO_LOG_TAG "esp8266.netconn"
#define MO_LOG_LVL MO_LOG_INFO
#include <mo_log.h>

#define SEND_DATA_MAX_SIZE (2048)

#define ESP8266_NETCONN_MQ_NAME "esp8266_nc_mq"

#ifndef ESP8266_NETCONN_MQ_MSG_SIZE
#define ESP8266_NETCONN_MQ_MSG_SIZE (sizeof(mo_notconn_msg_t))
#endif

#ifndef ESP8266_NETCONN_MQ_MSG_MAX
#define ESP8266_NETCONN_MQ_MSG_MAX  (10)
#endif

#define SET_EVENT(socket, event) (((socket + 1) << 16) | (event))

#define ESP8266_EVENT_SEND_OK   (1L << 0)
#define ESP8266_EVENT_RECV_OK   (1L << 1)
#define ESP8266_EVNET_CLOSE_OK  (1L << 2)
#define ESP8266_EVENT_CONN_FAIL (1L << 3)
#define ESP8266_EVENT_SEND_FAIL (1L << 4)

#define ESP8266_MULTI_CONN_ENABLE  (1)
#define ESP8266_MULTI_CONN_DISABLE (0)

#ifdef ESP8266_USING_NETCONN_OPS

static os_err_t esp8266_lock(os_mutex_t *mutex)
{
    return os_mutex_recursive_lock(mutex, OS_WAIT_FOREVER);
}

static os_err_t esp8266_unlock(os_mutex_t *mutex)
{
    return os_mutex_recursive_unlock(mutex);
}

static mo_netconn_t *esp8266_netconn_alloc(mo_object_t *module)
{
    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);

    at_parser_t *parser = &module->parser;

    char check_kw[AT_RESP_BUFF_SIZE_DEF / 4] = {0};

    char *resp_buff = os_calloc(1, AT_RESP_BUFF_SIZE_384);

    at_resp_t resp = {.buff = resp_buff, .buff_size = AT_RESP_BUFF_SIZE_384, .timeout = 5 * OS_TICK_PER_SECOND};

    at_parser_exec_cmd(parser, &resp, "AT+CIPSTATUS");

    for (int i = 0; i < ESP8266_NETCONN_NUM; i++)
    {
        if (NETCONN_STAT_NULL == esp8266->netconn[i].stat)
        {
            snprintf(check_kw, sizeof(check_kw), "+CIPSTATUS:%d", i);

            if (at_resp_get_line_by_kw(&resp, check_kw) == OS_NULL)
            {
                esp8266->netconn[i].connect_id = i;
                os_free(resp_buff);

                return &esp8266->netconn[i];
            }
        }
        else
        {
            DEBUG("netconn[%d] stat=%d", i, esp8266->netconn[i].stat);
        }
    }

    ERROR("Module %s alloc netconn failed!", module->name);

    os_free(resp_buff);

    return OS_NULL;
}

static mo_netconn_t *esp8266_get_netconn_by_id(mo_object_t *module, os_int32_t connect_id)
{
    OS_ASSERT(OS_NULL != module);

    if (0 > connect_id || ESP8266_NETCONN_NUM <= connect_id)
    {
        ERROR("%s INVALID connet_id:[%d]!", __func__, connect_id);
        return OS_NULL;
    }

    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);

    return &esp8266->netconn[connect_id];
}

os_err_t esp8266_netconn_get_info(mo_object_t *module, mo_netconn_info_t *info)
{
    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);

    info->netconn_array = esp8266->netconn;
    info->netconn_nums  = sizeof(esp8266->netconn) / sizeof(esp8266->netconn[0]);

    return OS_EOK;
}

mo_netconn_t *esp8266_netconn_create(mo_object_t *module, mo_netconn_type_t type)
{
    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);

    esp8266_lock(&esp8266->netconn_lock);

    mo_netconn_t *netconn = esp8266_netconn_alloc(module);

    if (OS_NULL == netconn)
    {
        esp8266_unlock(&esp8266->netconn_lock);
        return OS_NULL;
    }

    netconn->mq = os_mq_create(ESP8266_NETCONN_MQ_NAME, ESP8266_NETCONN_MQ_MSG_SIZE, ESP8266_NETCONN_MQ_MSG_MAX);
    if (OS_NULL == netconn->mq)
    {
        ERROR("%s data queue create failed, no enough memory.", module->name);
        esp8266_unlock(&esp8266->netconn_lock);
        return OS_NULL;
    }

    netconn->stat = NETCONN_STAT_INIT;
    netconn->type = type;

    esp8266_unlock(&esp8266->netconn_lock);

    return netconn;
}

os_err_t esp8266_netconn_destroy(mo_object_t *module, mo_netconn_t *netconn)
{
    at_parser_t *parser = &module->parser;
    os_err_t     result = OS_ERROR;

    DEBUG("Module %s in %d netconn status", module->name, netconn->stat);

    char resp_buff[AT_RESP_BUFF_SIZE_DEF] = {0};

    at_resp_t resp = {.buff = resp_buff, .buff_size = sizeof(resp_buff), .timeout = 5 * OS_TICK_PER_SECOND};
    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);
    if (esp8266 == OS_NULL)
    {
        ERROR("Module %s destroy netconn failed, get netconn_lock failed", module->name);
        return OS_ERROR;
    }
    esp8266_lock(&esp8266->netconn_lock);

    switch (netconn->stat)
    {
    case NETCONN_STAT_CONNECT:
        result = at_parser_exec_cmd(parser, &resp, "AT+CIPCLOSE=%d", netconn->connect_id);
        if (result != OS_EOK)
        {
            ERROR("Module %s destroy %s netconn failed",
                  module->name,
                  (netconn->type == NETCONN_TYPE_TCP) ? "TCP" : "UDP");
            esp8266_unlock(&esp8266->netconn_lock);
            return result;
        }
        break;

    default:
        /* add handler when we need */
        break;
    }

