flyghost/OneOS-V2.1.0/components/net/molink/module/esp8266/source/esp8266_netconn.c
    if (netconn->stat != NETCONN_STAT_NULL)
    {
        mo_netconn_mq_destroy(netconn->mq);
        netconn->mq = OS_NULL;
    }

    INFO("Module %s netconn id %d destroyed", module->name, netconn->connect_id);

    netconn->connect_id  = -1;
    netconn->stat        = NETCONN_STAT_NULL;
    netconn->type        = NETCONN_TYPE_NULL;
    netconn->remote_port = 0;
#ifdef MOLINK_USING_SOCKETS_OPS
    netconn->socket_id = -1;
    netconn->evt_func = OS_NULL;
    netconn->data_func = OS_NULL;
#endif
    inet_aton("0.0.0.0", &netconn->remote_ip);

    esp8266_unlock(&esp8266->netconn_lock);

    return OS_EOK;
}

os_err_t esp8266_netconn_bind(mo_object_t *module, mo_netconn_t *netconn, ip_addr_t addr, os_uint16_t port)
{
    at_parser_t *parser = &module->parser;

    char resp_buff[AT_RESP_BUFF_SIZE_DEF] = {0};

    at_resp_t resp = {.buff = resp_buff, .buff_size = sizeof(resp_buff), .timeout = 10 * OS_TICK_PER_SECOND};

    char remote_ip[IPADDR_MAX_STR_LEN + 1] = {0};

    //INFO("loacl addr step 1:0x%08x", addr.addr);
    //addr.addr |= 0x000000FF;
    //INFO("loacl addr step 2:0x%08x", addr.addr);
    strncpy(remote_ip, inet_ntoa(addr), IPADDR_MAX_STR_LEN);

    INFO("loacl addr:%s", remote_ip);
    os_err_t result = OS_EOK;

    switch (netconn->type)
    {
    case NETCONN_TYPE_UDP:
        result = at_parser_exec_cmd(parser,
                                    &resp,
                                    "AT+CIPSTART=%d,\"UDP\",\"%s\",0,%d,2",
                                    netconn->connect_id,
                                    remote_ip,
                                    port);                                   
        break;
    case NETCONN_TYPE_UDP_V6:
        result = at_parser_exec_cmd(parser,
                                    &resp,
                                    "AT+CIPSTART=%d,\"UDPv6\",\"::/128\",65535,%d",
                                    netconn->connect_id,
                                    port);
        break;
    default:
        ERROR("Module %s connect to %s:%d failed!", module->name, remote_ip, port);
        result = OS_ERROR;
        goto __exit;
    }

    if (result != OS_EOK)
    {
        goto __exit;
    }
    
__exit:
    if (OS_EOK == result)
    {
        ip_addr_copy(netconn->remote_ip, addr);
        netconn->remote_port = port;
        netconn->stat        = NETCONN_STAT_CONNECT;

        INFO("Module %s connect to %s:%d successfully!", module->name, remote_ip, port);
    }
    else
    {
        ERROR("Module %s connect to %s:%d failed!", module->name, remote_ip, port);
    }

    return result;
}

os_err_t esp8266_netconn_connect(mo_object_t *module, mo_netconn_t *netconn, ip_addr_t addr, os_uint16_t port)
{
    at_parser_t *parser = &module->parser;

    char resp_buff[AT_RESP_BUFF_SIZE_DEF] = {0};

    at_resp_t resp = {.buff = resp_buff, .buff_size = sizeof(resp_buff), .timeout = 150 * OS_TICK_PER_SECOND};

    char remote_ip[IPADDR_MAX_STR_LEN + 1] = {0};

    strncpy(remote_ip, inet_ntoa(addr), IPADDR_MAX_STR_LEN);

    os_err_t result = OS_EOK;

    switch (netconn->type)
    {
    case NETCONN_TYPE_TCP:
        result = at_parser_exec_cmd(parser,
                                    &resp,
                                    "AT+CIPSTART=%d,\"TCP\",\"%s\",%d,60",
                                    netconn->connect_id,
                                    remote_ip,
                                    port);
        break;

    case NETCONN_TYPE_UDP:
        result = at_parser_exec_cmd(parser,
                                    &resp,
                                    "AT+CIPSTART=%d,\"UDP\",\"%s\",%d",
                                    netconn->connect_id,
                                    remote_ip,
                                    port);
        break;

    default:
        ERROR("Module %s connect to %s:%d failed!", module->name, remote_ip, port);
        result = OS_ERROR;
        goto __exit;
    }

    if (result != OS_EOK)
    {
        goto __exit;
    }

__exit:
    if (OS_EOK == result)
    {
        ip_addr_copy(netconn->remote_ip, addr);
        netconn->remote_port = port;
        netconn->stat        = NETCONN_STAT_CONNECT;

        DEBUG("Module %s connect to %s:%d successfully!", module->name, remote_ip, port);
    }
    else
    {
        ERROR("Module %s connect to %s:%d failed!", module->name, remote_ip, port);
    }

    return result;
}

os_size_t esp8266_netconn_sendto(mo_object_t *module, mo_netconn_t *netconn, ip_addr_t addr, os_uint16_t port, const char *data, os_size_t size)
{
    char remote_ip[IPADDR_MAX_STR_LEN + 1] = {0};
    at_parser_t *parser    = &module->parser;
    os_err_t     result    = OS_EOK;
    os_size_t    sent_size = 0;
    os_size_t    curr_size = 0;
    os_uint32_t  event     = 0;

    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);
    
    char resp_buff[AT_RESP_BUFF_SIZE_DEF] = {0};

    strncpy(remote_ip, inet_ntoa(addr), IPADDR_MAX_STR_LEN);

    at_resp_t resp = {.buff      = resp_buff,
                      .buff_size = sizeof(resp_buff),
                      .timeout   = 5 * OS_TICK_PER_SECOND};
    at_parser_exec_lock(parser);

    esp8266->curr_connect = netconn->connect_id;
    at_parser_set_end_mark(parser, ">", 1);

    while (sent_size < size)
    {
        if (size - sent_size < SEND_DATA_MAX_SIZE)
        {
            curr_size = size - sent_size;
        }
        else
        {
            curr_size = SEND_DATA_MAX_SIZE;
        }

        /* Protect the data sending process, prevent other threads to send AT commands */

        result = at_parser_exec_cmd(parser, &resp, "AT+CIPSEND=%d,%d,\"%s\",%d", netconn->connect_id, curr_size, remote_ip, port);
        if (result != OS_EOK)
        {
            goto __exit;
        }

        if (at_parser_send(parser, data + sent_size, curr_size) <= 0)
        {
            result = OS_ERROR;
            goto __exit;
        }

        result = os_event_recv(&esp8266->netconn_evt,
                               SET_EVENT(netconn->connect_id, 0),
                               OS_EVENT_OPTION_OR | OS_EVENT_OPTION_CLEAR,
                               10 * OS_TICK_PER_SECOND,
                               OS_NULL);
        if (result != OS_EOK)
        {
            ERROR("Module %s connect id %d wait event timeout!", module->name, netconn->connect_id);
            goto __exit;
        }

