flyghost/OneOS-V2.1.0/components/net/molink/module/esp8266/source/esp8266_netconn.c
        result = os_event_recv(&esp8266->netconn_evt,
                               ESP8266_EVENT_SEND_OK | ESP8266_EVENT_SEND_FAIL,
                               OS_EVENT_OPTION_OR | OS_EVENT_OPTION_CLEAR,
                               1 * OS_TICK_PER_SECOND,
                               &event);
        if (result != OS_EOK)
        {
            ERROR("Module %s connect id %d wait send result timeout!", module->name, netconn->connect_id);
            goto __exit;
        }

        if (event & ESP8266_EVENT_SEND_FAIL)
        {
            ERROR("Module %s connect id %d send failed!", module->name, netconn->connect_id);
            result = OS_ERROR;
            goto __exit;
        }

        if (netconn->type == NETCONN_TYPE_TCP)
        {
            curr_size = esp8266->curr_sent_size;
        }

        sent_size += curr_size;
        os_task_msleep(30);
    }

__exit:

    at_parser_set_end_mark(parser, OS_NULL, 0);
    esp8266->curr_connect = -1;

    at_parser_exec_unlock(parser);

    if (result != OS_EOK)
    {
        ERROR("Module %s netconn %d send %d bytes data failed!", parser->name, netconn->connect_id, size);
        
        return 0;
    }

    return sent_size;
}

os_size_t esp8266_netconn_send(mo_object_t *module, mo_netconn_t *netconn, const char *data, os_size_t size)
{
    at_parser_t *parser    = &module->parser;
    os_err_t     result    = OS_EOK;
    os_size_t    sent_size = 0;
    os_size_t    curr_size = 0;
    os_uint32_t  event     = 0;

    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);
    
    char resp_buff[AT_RESP_BUFF_SIZE_DEF] = {0};

    at_resp_t resp = {.buff      = resp_buff,
                      .buff_size = sizeof(resp_buff),
                      .timeout   = 5 * OS_TICK_PER_SECOND};
					  
	/* Protect the data sending process, prevent other threads to send AT commands */
    at_parser_exec_lock(parser);

    esp8266->curr_connect = netconn->connect_id;
    at_parser_set_end_mark(parser, ">", 1);

    while (sent_size < size)
    {
        if (netconn->stat != NETCONN_STAT_CONNECT)
        {
            ERROR("Module %s netconn %d isn't in the CONNECT state, send data fail", parser->name, netconn->connect_id);
            result = OS_ERROR;
            goto __exit;
        }

        if (size - sent_size < SEND_DATA_MAX_SIZE)
        {
            curr_size = size - sent_size;
        }
        else
        {
            curr_size = SEND_DATA_MAX_SIZE;
        }

        /* Protect the data sending process, prevent other threads to send AT commands */

        result = at_parser_exec_cmd(parser, &resp, "AT+CIPSEND=%d,%d", netconn->connect_id, curr_size);
        if (result != OS_EOK)
        {
            goto __exit;
        }

        if (at_parser_send(parser, data + sent_size, curr_size) != curr_size)
        {
            result = OS_ERROR;
            ERROR("Drv or hardware send data fail, some data is missing.\r\n");
            goto __exit;
        }

        result = os_event_recv(&esp8266->netconn_evt,
                               SET_EVENT(netconn->connect_id, 0),
                               OS_EVENT_OPTION_OR | OS_EVENT_OPTION_CLEAR,
                               10 * OS_TICK_PER_SECOND,
                               OS_NULL);
        if (result != OS_EOK)
        {
            ERROR("Module %s connect id %d wait event timeout!", module->name, netconn->connect_id);
            goto __exit;
        }

        result = os_event_recv(&esp8266->netconn_evt,
                               ESP8266_EVENT_SEND_OK | ESP8266_EVENT_SEND_FAIL,
                               OS_EVENT_OPTION_OR | OS_EVENT_OPTION_CLEAR,
                               1 * OS_TICK_PER_SECOND,
                               &event);
        if (result != OS_EOK)
        {
            ERROR("Module %s connect id %d wait send result timeout!", module->name, netconn->connect_id);
            goto __exit;
        }

        if (event & ESP8266_EVENT_SEND_FAIL)
        {
            ERROR("Module %s connect id %d send failed!", module->name, netconn->connect_id);
            result = OS_ERROR;
            goto __exit;
        }

        if (netconn->type == NETCONN_TYPE_TCP)
        {
            curr_size = esp8266->curr_sent_size;
        }

        sent_size += curr_size;
        os_task_msleep(30);
    }

__exit:

    at_parser_set_end_mark(parser, OS_NULL, 0);
    esp8266->curr_connect = -1;
    at_parser_exec_unlock(parser);

    if (result != OS_EOK)
    {
        ERROR("Module %s netconn %d send %d bytes data failed!", parser->name, netconn->connect_id, size);
        return 0;
    }

    return sent_size;
}

os_err_t esp8266_netconn_gethostbyname(mo_object_t *module, const char *domain_name, ip_addr_t *addr)
{
    OS_ASSERT(OS_NULL != domain_name);
    OS_ASSERT(OS_NULL != addr);

    char recvip[IPADDR_MAX_STR_LEN + 1] = {0};

    at_parser_t *parser = &module->parser;

    char resp_buff[AT_RESP_BUFF_SIZE_128] = {0};

    at_resp_t resp = {.buff      = resp_buff,
                      .buff_size = sizeof(resp_buff),
                      .timeout   = 20 * OS_TICK_PER_SECOND};

    os_err_t result = at_parser_exec_cmd(parser, &resp, "AT+CIPDOMAIN=\"%s\"", domain_name);
    if (result != OS_EOK)
    {
        goto __exit;
    }

    if (at_resp_get_data_by_kw(&resp, "+CIPDOMAIN:", "+CIPDOMAIN:%s", recvip) <= 0)
    {
        ERROR("Module %s domain resolve: resp parse fail, try again, host: %s", module->name, domain_name);
        result = OS_ERROR;
        /* If resolve failed, maybe receive an URC CRLF */
        goto __exit;
    }

    if (strlen(recvip) < IPADDR_MIN_STR_LEN)
    {
        ERROR("Module %s domain resolve: recvip len < IPADDR_MIN_STR_LEN, len = %d", module->name, strlen(recvip));
        result = OS_ERROR;
        goto __exit;
    }
    else
    {
        DEBUG("Module %s domain resolve: \"%s\" domain ip is %s, addrlen %d",
              module->name,
              domain_name,
              recvip,
              strlen(recvip));

        inet_aton(recvip, addr);
#ifdef MOLINK_USING_IPV4
#ifdef MOLINK_USING_IPV6
        if (IPADDR_ANY == addr->u_addr.ip4.addr || IPADDR_LOOPBACK == addr->u_addr.ip4.addr) 
#else
        if (IPADDR_ANY == addr->addr || IPADDR_LOOPBACK == addr->addr)
#endif        
        {
            ip_addr_set_zero(addr);
            result = OS_ERROR;
            goto __exit;
        }
#endif
        result = OS_EOK;
    }

__exit:

    return result;
}

