flyghost/OneOS-V2.1.0/components/net/molink/module/esp8266/source/esp8266_netconn.c
static void urc_send_func(struct at_parser *parser, const char *data, os_size_t size)
{
    OS_ASSERT(OS_NULL != parser);
    OS_ASSERT(OS_NULL != data);

    mo_object_t  *module  = os_container_of(parser, mo_object_t, parser);
    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);

    os_int32_t curr_connect = esp8266->curr_connect;

    if (strstr(data, "SEND OK"))
    {
        os_event_send(&esp8266->netconn_evt, SET_EVENT(curr_connect, ESP8266_EVENT_SEND_OK));
    }
    else if (strstr(data, "SEND FAIL"))
    {
        os_event_send(&esp8266->netconn_evt, SET_EVENT(curr_connect, ESP8266_EVENT_SEND_FAIL));
    }

    return;
}

static void urc_close_func(struct at_parser *parser, const char *data, os_size_t size)
{
    OS_ASSERT(OS_NULL != parser);
    OS_ASSERT(OS_NULL != data);

    os_int32_t connect_id = 0;

    sscanf(data, "%d,CLOSED", &connect_id);

    mo_object_t  *module  = os_container_of(parser, mo_object_t, parser);
    mo_netconn_t *netconn = esp8266_get_netconn_by_id(module, connect_id);

    if (OS_NULL == netconn)
    {
        ERROR("Module %s receive error close urc data of connect %d", module->name, connect_id);
        return;
    }

    INFO("Module %s receive close urc data of connect %d", module->name, connect_id);

    mo_netconn_pasv_close_notice(netconn);

    return;
}

static void urc_send_bfsz_func(struct at_parser *parser, const char *data, os_size_t size)
{
    OS_ASSERT(OS_NULL != parser);
    OS_ASSERT(OS_NULL != data);

    mo_object_t  *module  = os_container_of(parser, mo_object_t, parser);
    mo_esp8266_t *esp8266 = os_container_of(module, mo_esp8266_t, parent);

    os_int32_t send_bfsz = 0;

    sscanf(data, "Recv %d bytes", &send_bfsz);

    esp8266->curr_sent_size = send_bfsz;

    return;
}

static void urc_recv_read_param(struct at_parser *parser, char *buf, int commas_cnt, int colon_cnt)
{
    int recv_commas_cnt;
    int recv_colon_cnt;
    int recv_cnt;
    os_size_t size;

    recv_commas_cnt = 0;
    recv_colon_cnt = 0;
    recv_cnt = 0;

    while (recv_commas_cnt < commas_cnt)
    {
        size = at_parser_recv(parser, buf + recv_cnt, 1, OS_WAIT_FOREVER);
        if (size > 0)
        {
            if (',' == buf[recv_cnt])
            {
                recv_commas_cnt++;
            }
            recv_cnt++;
        }
    }

    while (recv_colon_cnt < colon_cnt)
    {
        size = at_parser_recv(parser, buf + recv_cnt, 1, OS_WAIT_FOREVER);
        if (size > 0)
        {
            if (':' == buf[recv_cnt])
            {
                recv_colon_cnt++;
            }
            recv_cnt++;
        }
    }

    return;
}

static void urc_recv_func(struct at_parser *parser, const char *data, os_size_t size)
{
    OS_ASSERT(OS_NULL != parser);
    OS_ASSERT(OS_NULL != data);

    os_int32_t connect_id = 0;
    os_int32_t data_size  = 0;
    char remote_ip[IPADDR_MAX_STR_LEN + 1 + 2] = {0};
    char ipd_prefix[80];
    ip_addr_t addr;
    os_uint16_t port;
    int len;

    mo_object_t  *module  = os_container_of(parser, mo_object_t, parser);
    mo_esp8266_t *esp8266  = os_container_of(module, mo_esp8266_t, parent);

    memset(ipd_prefix, 0, sizeof(ipd_prefix));
    memcpy(ipd_prefix, data, size);
#ifdef ESP8266_USING_WIFI_OPS
    if (MO_WIFI_CIPINFO_SHOW_IP_PORT == esp8266->wifi_ipdinfo)
    {
        urc_recv_read_param(parser, ipd_prefix + size, 3, 1);
        sscanf(ipd_prefix, "+IPD,%d,%d,%[^,],%hu:", &connect_id, &data_size, remote_ip, &port);
        if (remote_ip[0] == '"')
        {
            len = strlen(remote_ip);
            memmove(remote_ip, remote_ip + 1, len - 2);
            remote_ip[len - 2] = 0x00;
        }
    }
    else
#endif
    {
        urc_recv_read_param(parser, ipd_prefix + size, 1, 1);
        sscanf(ipd_prefix, "+IPD,%d,%d:", &connect_id, &data_size);
    }

    os_int32_t timeout = data_size > 10 ? data_size : 10;
	// INFO("--%s", ipd_prefix);
    // INFO("Moudle %s netconn %d receive %d bytes data from[%s,%d]", parser->name, connect_id, data_size, remote_ip, port);

    mo_netconn_t *netconn = esp8266_get_netconn_by_id(module, connect_id);

    if (OS_NULL == netconn)
    {
        ERROR("Module %s receive error recv urc data of connect %d", module->name, connect_id);
        return;
    }

    char *recv_buff = os_calloc(1, data_size + 1);
    if (recv_buff == OS_NULL)
    {
        /* read and clean the coming data */
        ERROR("os_calloc recv buff %d bytes fail, no enough memory", data_size);
        os_size_t temp_size    = 0;
        char      temp_buff[8] = {0};

        while (temp_size < data_size)
        {
            if (data_size - temp_size > sizeof(temp_buff))
            {
                at_parser_recv(parser, temp_buff, sizeof(temp_buff), timeout);
            }
            else
            {
                at_parser_recv(parser, temp_buff, data_size - temp_size, timeout);
            }

            temp_size += sizeof(temp_buff);
        }

        return;
    }

    if (at_parser_recv(parser, recv_buff, data_size, timeout) != data_size)
    {
        ERROR("Module %s netconnt id %d recv %d bytes data failed!", module->name, netconn->connect_id, data_size);
        os_free(recv_buff);

        return;
    }
    
    ip_addr_set_zero(&addr);
    if (NETCONN_TYPE_UDP_V6 == netconn->type || NETCONN_TYPE_TCP_V6 == netconn->type)
    {
        IP_SET_TYPE(&addr, IPADDR_TYPE_V6);   
    }
    
    inet_aton(remote_ip, &addr);
    mo_wifi_netconn_data_recv_notice(netconn, addr, (os_uint16_t)port, recv_buff, data_size);

    return;
}

static at_urc_t gs_urc_table[] = {
    {.prefix = "SEND OK",   .suffix = "\r\n",        .func = urc_send_func},
    {.prefix = "SEND FAIL", .suffix = "\r\n",        .func = urc_send_func},
    {.prefix = "Recv",      .suffix = "bytes\r\n",   .func = urc_send_bfsz_func},
    {.prefix = "+IPD",      .suffix = ",",           .func = urc_recv_func},
    {.prefix = "",          .suffix = ",CLOSED\r\n", .func = urc_close_func},
};

os_err_t esp8266_netconn_init(mo_esp8266_t *module)
{
    at_parser_t *parser = &(module->parent.parser);

    char resp_buff[AT_RESP_BUFF_SIZE_DEF] = {0};

    at_resp_t resp = {.buff = resp_buff, .buff_size = sizeof(resp_buff), .timeout = AT_RESP_TIMEOUT_DEF};

    os_err_t result = at_parser_exec_cmd(parser, &resp, "AT+CIPMUX?");
    if (result != OS_EOK)
    {
        return result;
    }

    os_int32_t mode = 0;

    if (at_resp_get_data_by_kw(&resp, "+CIPMUX:", "+CIPMUX:%d", &mode) <= 0)
    {
        return OS_ERROR;
    }

    if (ESP8266_MULTI_CONN_ENABLE == mode)
    {
        /* Close all connections */
        result = at_parser_exec_cmd(parser, &resp, "AT+CIPCLOSE=5");
    }
    else
    {
        result = at_parser_exec_cmd(parser, &resp, "AT+CIPMUX=1");
    }

    if (result != OS_EOK)
    {
        return result;
    }

    /* Init module netconn array */
    memset(module->netconn, 0, sizeof(module->netconn));
    for (int i = 0; i < ESP8266_NETCONN_NUM; i++)
    {
        module->netconn[i].connect_id = -1;
    }

    at_parser_set_urc_table(parser, gs_urc_table, sizeof(gs_urc_table) / sizeof(gs_urc_table[0]));

    return result;
}

#endif /* ESP8266_USING_NETCONN_OPS */
